In [ ]:
========== EDA ==========
1) Pandas: Data frame applications
2) Numpy: Numerical python all maths applications
3) Matplotlib: used for plotting
4) Seaborn: used for plotting
5) plotly: used for plotting
6) Bokhe: used for plotting

========== ML ==========
7) Scikit-learn: sklearn

========== DL ==========
8)  Tensorflow: Google 
9)  Keras: Google
10) Pytorch: Facebook

========== NLP ==========
11) NLTK: Natural Language Tool Kit 
12) Scipy 

========== BERT ==========
13) Transformers: Hugging face(Google)

========== Google models ==========
14) Some specific google packages

========== Azure ML ==========
15) Azure packages

========== GenAI ==========
16) GeminiAI: Google
17) ChatGPT : OpenAI

========== LangChain ==========
18) LangChain packages

#### (1Q) Create a data-frame using list:

#### Step-1: 
- Create an empty dataframe

In [1]:
import pandas as pd 
names=['Ayush', 'Avinash', 'Akash']
pd.DataFrame()  # Empty data frame with no rows & no columns

Empty DataFrame
Columns: []
Index: []

#### Step-2: 
- Provide the data

In [ ]:
names=['Ayush', 'Avinash', 'Akash']
age=[24,27,25]
pd.DataFrame(names,age)

# Since we need two columns for two lists,but here with in the same column both the lists are given,
#Enter shift+Tab inside parenthesis of .DataFrame()
#1st variable indicates the data consideration for table then after 1st comma,
#2nd variable is for indexes consideration then after 2nd comma,
#3rd variable is for columns consideration
# SO in the above 'pd.DataFrame(names,age)'
# names is considered as data of the table ---> (which is totally fine)
# But "age" is also considered as the data for Table rather than index consideration

In [ ]:
#Enter shift+Tab inside parenthesis of .DataFrame()

Init signature:
pd.DataFrame(
    data=None,                      --> 1st place is for 'data' only
    index: 'Axes | None' = None,    --> 2nd place os for 'index' only
    columns: 'Axes | None' = None,  -->  3rd place is reserved for 'column_names' only
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'

In [2]:
names=['Ayush', 'Avinash', 'Akash']
age=[24,27,25]
pd.DataFrame(zip(names,age))

# To overcome from the problem faced in previous we need to use 'zip'
# 'zip': in order to indicate that variables mentioned inside zip() must be considered as data of the table

         0   1
0    Ayush  24
1  Avinash  27
2    Akash  25

In [3]:
names=['Ayush', 'Avinash', 'Akash']
age=[24,27,25]
city=['Hyd','Blr','Klkt']
pd.DataFrame(zip(names,age,city))

         0   1     2
0    Ayush  24   Hyd
1  Avinash  27   Blr
2    Akash  25  Klkt

#### Step-3:

- Providing the indexes

In [4]:
names=['Ayush', 'Avinash', 'Akash']
age=[24,27,25]
city=['Hyd','Blr','Klkt']
pd.DataFrame(zip(names,age,city),index=[1,2,3])

         0   1     2
1    Ayush  24   Hyd
2  Avinash  27   Blr
3    Akash  25  Klkt

#### Step-4:
- Providing the column names

In [5]:
names=['Ayush', 'Avinash', 'Akash']
age=[24,27,25]
city=['Hyd','Blr','Klkt']
pd.DataFrame(zip(names,age,city),index=[1,2,3],columns=['Names','Age','City'])

     Names  Age  City
1    Ayush   24   Hyd
2  Avinash   27   Blr
3    Akash   25  Klkt

#### Practise:
- With a good approach

In [6]:
names=['Amer','Zaid','Shajie']
age=['20','9','21']
city=['Hyd','Hyd','Hyd']

data=zip(names,age,city)
indx=[1,2,3]
cols=['Names','Age','City']

df=pd.DataFrame(data,indx,cols)
df

    Names Age City
1    Amer  20  Hyd
2    Zaid   9  Hyd
3  Shajie  21  Hyd

#### Step-5

- Add a new column
- If you wanna add a new column, first you need to check the number of rows in already existing data
- For example in above dataframe, it has 3 rows
- Yo need to create a new list with 3 rows
- That list equate to the dataframe

In [7]:
designation=['Data Scientist','Data Engg','Data Analyst'] 
df['Designation']=designation
df

    Names Age City     Designation
1    Amer  20  Hyd  Data Scientist
2    Zaid   9  Hyd       Data Engg
3  Shajie  21  Hyd    Data Analyst

#### Step-6:
- Update the already existing columns

In [8]:
df['Age']=[32,22,33]
df

    Names  Age City     Designation
1    Amer   32  Hyd  Data Scientist
2    Zaid   22  Hyd       Data Engg
3  Shajie   33  Hyd    Data Analyst

#### Note:
- "Number of list" must be equal to "Number of Columns"
- "Number of values" must be equal to "Number of Rows"

#### Step-7

**shape**
- Number of rows 
- Number of columns

In [9]:
df.shape

# Matrix format
# 3 rows & 4 columns
# '0' means rows
# '1' means columns

print("The number of rows are:",df.shape[0])
print("The number of columns are:",df.shape[1])

The number of rows are: 3
The number of columns are: 4

#### Step-8:
**Drop the column:**
    - In order to drop column we required 3 arguments

- **Column name** 
    - The column name we need to mention

- **axis**
    - axis=0 **represents rows** 
    - axis=1  **represents columns**

- **inplace** 
    - we are dropping columns means we are modifing the data frame 
    - so this modifications we wanna save in same variable or different variable
    - If you wanna keep in the same variable the **inplace=True**

In [10]:
df

    Names  Age City     Designation
1    Amer   32  Hyd  Data Scientist
2    Zaid   22  Hyd       Data Engg
3  Shajie   33  Hyd    Data Analyst

In [11]:
df.drop('City',axis=1,inplace=True)
df

    Names  Age     Designation
1    Amer   32  Data Scientist
2    Zaid   22       Data Engg
3  Shajie   33    Data Analyst

In [12]:
df1=df.drop('Designation',axis=1)
df1

    Names  Age
1    Amer   32
2    Zaid   22
3  Shajie   33

In [13]:
df

    Names  Age     Designation
1    Amer   32  Data Scientist
2    Zaid   22       Data Engg
3  Shajie   33    Data Analyst

#### Step-9:
- Dropping multiple columns

In [14]:
df

    Names  Age     Designation
1    Amer   32  Data Scientist
2    Zaid   22       Data Engg
3  Shajie   33    Data Analyst

In [15]:
df.drop(['Age','Designation'],axis=1,inplace=True)
df

    Names
1    Amer
2    Zaid
3  Shajie

#### Step-10:
- Dropping the rows

In [16]:
df

    Names
1    Amer
2    Zaid
3  Shajie

In [17]:
# Reading the data from initial point:
import pandas as pd
names=['Amer','Zaid','Shajie']
age=[32,22,33]
city=['Hyd','Hyd','Blr']
designation=['Data Scientist','Data Engg','Data Analyst']

data=zip(names,age,city,designation)
indx=[1,2,3]
cols=['Name','Age','City','Designation']  

df=pd.DataFrame(data,indx,cols)
df

     Name  Age City     Designation
1    Amer   32  Hyd  Data Scientist
2    Zaid   22  Hyd       Data Engg
3  Shajie   33  Blr    Data Analyst

In [18]:
df.drop(1,axis=0,inplace=True)
df

     Name  Age City   Designation
2    Zaid   22  Hyd     Data Engg
3  Shajie   33  Blr  Data Analyst

#### Step 11:
**How to save the data frame**
- Generally data frames are of two types
- csv(comma seperated value)
- excel

In [19]:
df

     Name  Age City   Designation
2    Zaid   22  Hyd     Data Engg
3  Shajie   33  Blr  Data Analyst

In [20]:
# file name=data
# extension=.csv
df.to_csv('data.csv') 
df.to_csv('data1.csv',index=False)  # indexes will get disappear in excel sheet

In [21]:
# Extension
#.xlsx
df.to_excel("data2.xlsx",index=False)

In [22]:
df

     Name  Age City   Designation
2    Zaid   22  Hyd     Data Engg
3  Shajie   33  Blr  Data Analyst

#### Running new data from initial point:

In [23]:
name=['Amer','Zaid','Shajie']
age=[32,22,33]
city=['Hyd','Riyadh','Ontario']
country=['India','Saudi_Arabia','Canada']
designation=['Data Scientist','Data Engg','Data Analyst']

data=zip(name,age,city,country,designation)
indx=['A','B','C']
cols=['Name','Age','City','Country','Designation']

df1=pd.DataFrame(data,indx,cols)
df1

     Name  Age     City       Country     Designation
A    Amer   32      Hyd         India  Data Scientist
B    Zaid   22   Riyadh  Saudi_Arabia       Data Engg
C  Shajie   33  Ontario        Canada    Data Analyst

In [24]:
df2=df1.drop('C',axis=0,inplace=False)
df2

   Name  Age    City       Country     Designation
A  Amer   32     Hyd         India  Data Scientist
B  Zaid   22  Riyadh  Saudi_Arabia       Data Engg

In [25]:
df1

     Name  Age     City       Country     Designation
A    Amer   32      Hyd         India  Data Scientist
B    Zaid   22   Riyadh  Saudi_Arabia       Data Engg
C  Shajie   33  Ontario        Canada    Data Analyst

In [26]:
df1.drop('C',axis=0,inplace=True)
df1

   Name  Age    City       Country     Designation
A  Amer   32     Hyd         India  Data Scientist
B  Zaid   22  Riyadh  Saudi_Arabia       Data Engg

In [27]:
df1

   Name  Age    City       Country     Designation
A  Amer   32     Hyd         India  Data Scientist
B  Zaid   22  Riyadh  Saudi_Arabia       Data Engg

In [28]:
df1.to_csv('new-data.csv')